[
  {
    "id": "1",
    "brand_logo": "https://i.ibb.co/1L061c3/google.png",
    "job_title": "Search Algorithm Specialist",
    "brand": "Google",
    "location": "Mountain View, CA",
    "salary": "$120,000 - $150,000",
    "email": "hiring@google.com",
    "phone": "650-253-0000",
    "job_description": "As a Search Algorithm Specialist at Google, the candidate will be at the forefront of enhancing search capabilities and algorithms. The role demands continuous collaboration with software engineers, understanding the dynamics of search behaviors, and ensuring the delivery of the most relevant search results to billions of users around the world.",
    "job_responsibility": "The individual will be responsible for maintaining and optimizing the search engine, collaborating closely with cross-functional teams, analyzing user feedback, improving the user experience, ensuring high relevancy in search results, and actively participating in the research and development of innovative search features and techniques. The role also involves troubleshooting, providing solutions for any search-related issues, and continuously staying updated with the latest trends in search algorithms.",
    "educational_requirements": "Bachelor's in Computer Science or equivalent.",
    "experiences": "3+ years in search algorithms or related field."
  },
  {
    "id": "2",
    "brand_logo": "https://i.ibb.co/Gc5wP25/netflix.png",
    "job_title": "Content Strategist",
    "brand": "Netflix",
    "location": "Los Gatos, CA",
    "salary": "$100,000 - $130,000",
    "email": "careers@netflix.com",
    "phone": "408-540-3700",
    "job_description": "As a Content Strategist at Netflix, you will play a pivotal role in planning and executing content strategies that align with the company's vision and viewers' interests. With a keen understanding of viewer demographics and preferences, you will curate content that resonates with our global audience.",
    "job_responsibility": "Key responsibilities include curating content across different genres, analyzing viewer data to gauge content performance, liaising with production and creative teams to develop original shows, attending industry events to spot content trends, and providing feedback for content improvement. Ensuring content consistency, quality, and relevancy across all platforms is paramount. Collaboration with marketing teams to promote content and gauge audience reception will also be part of the role.",
    "educational_requirements": "Bachelor's in Media or equivalent.",
    "experiences": "3+ years in content planning or similar role."
  },
  {
    "id": "3",
    "brand_logo": "https://i.ibb.co/jGT9H6y/tesla.png",
    "job_title": "Automotive Engineer",
    "brand": "Tesla, Inc.",
    "location": "Palo Alto, CA",
    "salary": "$95,000 - $125,000",
    "email": "jobs@tesla.com",
    "phone": "650-681-5000",
    "job_description": "As an Automotive Engineer at Tesla, Inc., you will be diving into the intricate world of electric vehicle design. Your expertise will shape the next generation of Tesla vehicles, ensuring they are both innovative and functional.",
    "job_responsibility": "This role involves working closely on car design, especially focusing on enhancing electric and mechanical systems. You'll collaborate with multiple teams to optimize energy efficiency, ensure vehicle safety, and improve overall vehicle performance. From conceptualization to production, you'll be integral in ensuring our vehicles are built to the highest standards and remain at the forefront of the automotive industry.",
    "educational_requirements": "Bachelor's in Automotive Engineering.",
    "experiences": "4+ years in automotive design or related."
  },
  {
    "id": "4",
    "brand_logo": "https://i.ibb.co/DK4jyTB/Apple-Logo-PNG-Photos.png",
    "job_title": "iOS Developer",
    "brand": "Apple Inc.",
    "location": "Cupertino, CA",
    "salary": "$110,000 - $140,000",
    "email": "recruitment@apple.com",
    "phone": "408-996-1010",
    "job_description": "Joining Apple Inc. as an iOS Developer means stepping into the world of cutting-edge app development. You will be creating applications that millions of users around the globe will experience and love.",
    "job_responsibility": "Your responsibilities will encompass the full spectrum of app development. This includes designing visually appealing and user-friendly interfaces, coding efficiently, collaborating with UI/UX designers, testing for bugs, and ensuring apps are optimized for various iOS devices. Staying updated with the latest in iOS trends, understanding user feedback, and iterating based on that feedback will also be essential parts of your role.",
    "educational_requirements": "Bachelor's in Computer Science.",
    "experiences": "3+ years in iOS development."
  },
  {
    "id": "5",
    "brand_logo": "https://i.ibb.co/v1GQXfQ/pngwing-com-3.png",
    "job_title": "Product Designer",
    "brand": "Nike",
    "location": "Beaverton, OR",
    "salary": "$70,000 - $95,000",
    "email": "designjobs@nike.com",
    "phone": "503-671-6453",
    "job_description": "As a Product Designer at Nike, you will be crafting the future of sportswear. Nike believes in innovation, and your designs will bring fresh perspectives to sportswear, influencing athletes and enthusiasts alike.",
    "job_responsibility": "Your main duties will involve conceptualizing fresh and functional designs, working closely with the production team to ensure feasibility, studying market trends to stay ahead of the curve, and frequently collaborating with marketing to understand consumer feedback. Ensuring the brand's legacy of quality and style remains intact while pushing boundaries will be a challenge you'll embrace.",
    "educational_requirements": "Bachelor's in Design.",
    "experiences": "2+ years in sportswear design."
  },
  {
    "id": "6",
    "brand_logo": "https://i.ibb.co/GPTD78Y/pngwing-com-4.png",
    "job_title": "Marketing Specialist",
    "brand": "Starbucks",
    "location": "Seattle, WA",
    "salary": "$60,000 - $80,000",
    "email": "marketingjobs@starbucks.com",
    "phone": "206-447-1575",
    "job_description": "As a Marketing Specialist at Starbucks, you will be in charge of bringing our products closer to the hearts of customers. Your strategies and campaigns will shape the way people perceive and interact with the Starbucks brand.",
    "job_responsibility": "Your core responsibilities will encompass researching market trends, devising and implementing innovative marketing strategies, collaborating with sales teams to drive revenue, ensuring brand consistency across all campaigns, and evaluating campaign performance to optimize ROI. Attending industry events, staying updated with the latest marketing tools, and ensuring the brand's voice resonates with the target audience will also be key aspects of your role.",
    "educational_requirements": "Bachelor's in Marketing.",
    "experiences": "2+ years in marketing or related field."
  }
]
